---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndSpanhookAlt
source: html/719d8eba-2b2e-380b-8217-7db754c37533.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndSpanhookAlt Property

"End Hook Angle Alternating"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndSpanhookAlt { get; }
```